--------------------------------------------------------------
--桌子状态
gameflag={notstart=0,  start=1}

--座位的开始状态(废弃但必须存在)
startflag = {notready = 0, ready = 1}


--room初始化相关参数------------------------------------------
--------------------------------------------------------------
--桌子数量
room.cfg.deskcount = 400
--最少几人可以开始游戏,默认为2
room.cfg.MinDeskSiteCount = 2
--桌子上位置数量
room.cfg.DeskSiteCount = 9

--tex初始化相关参数------------------------------------------
--------------------------------------------------------------
tex = {}
tex.cfg = {}
tex.arg = newStrongTable({deskno = 0, curdesksite = 0, watchingUserinfo = {}, userinfo = {}})
tex.cfg.mingoldweight 	= 1			--每局最小,1倍乘赔率
tex.cfg.maxgoldweight 	= 100		--每局最大,100倍乘赔率

tex.cfg.winexp 		= 150		--赢了+多少经验 
tex.cfg.choushui		= 0.15      --抽水比例
tex.cfg.fast = 0   --快速场标志
tex.cfg.fastdelay = 12  --快速场的最快速度


--tex:牌的相关信息
tex.randpokes = {}

--牌的字符表示
tex.pokechar = {
[1]   = 'A', [2] = '2', [3]   = '3',[4]  = '4', [5]   = '5',[6]   = '6',[7]   = '7',[8]   = '8',[9]   = '9',[10] = 'X',[11] = 'J',[12] = 'Q',[13] = 'K',
[14]  = 'A', [15] = '2',[16]  = '3',[17]  = '4',[18]  = '5',[19]  = '6',[20]  = '7',[21]  = '8',[22]  = '9',[23] = 'X',[24] = 'J',[25] = 'Q',[26] = 'K',
[27]  = 'A', [28] = '2',[29]  = '3',[30]  = '4',[31]  = '5',[32]  = '6',[33]  = '7',[34]  = '8',[35]  = '9',[36] = 'X',[37] = 'J',[38] = 'Q',[39] = 'K',
[40]  = 'A', [41] = '2',[42]  = '3',[43]  = '4',[44]  = '5',[45]  = '6',[46]  = '7',[47]  = '8',[48]  = '9',[49] = 'X',[50] = 'J',[51] = 'Q',[52] = 'K',
}
--牌的数字表示
tex.pokenum = {
[1]   = 14, [2] = 2, [3]   = 3,[4]   = 4, [5]   = 5,[6]   = 6,[7]   = 7,[8]   = 8,[9]   = 9,[10] = 10,[11] = 11,[12] = 12,[13] = 13,
[14]  = 14, [15] = 2,[16]  = 3,[17]  = 4, [18]  = 5,[19]  = 6,[20]  = 7,[21]  = 8,[22]  = 9,[23] = 10,[24] = 11,[25] = 12,[26] = 13,
[27]  = 14, [28] = 2,[29]  = 3,[30]  = 4, [31]  = 5,[32]  = 6,[33]  = 7,[34]  = 8,[35]  = 9,[36] = 10,[37] = 11,[38] = 12,[39] = 13,
[40]  = 14, [41] = 2,[42]  = 3,[43]  = 4, [44]  = 5,[45]  = 6,[46]  = 7,[47]  = 8,[48]  = 9,[49] = 10,[50] = 11,[51] = 12,[52] = 13,
}
--牌的花色表示
tex.pokecolor = {
[1]   = 1, [2] = 1, [3]   = 1,[4]   = 1, [5]   = 1,[6]   = 1,[7]   = 1,[8]   = 1,[9]   = 1,[10] = 1,[11] = 1,[12] = 1,[13] = 1,
[14]  = 2, [15] = 2,[16]  = 2,[17]  = 2, [18]  = 2,[19]  = 2,[20]  = 2,[21]  = 2,[22]  = 2,[23] = 2,[24] = 2,[25] = 2,[26] = 2,
[27]  = 3, [28] = 3,[29]  = 3,[30]  = 3, [31]  = 3,[32]  = 3,[33]  = 3,[34]  = 3,[35]  = 3,[36] = 3,[37] = 3,[38] = 3,[39] = 3,
[40]  = 4, [41] = 4,[42]  = 4,[43]  = 4, [44]  = 4,[45]  = 4,[46]  = 4,[47]  = 4,[48]  = 4,[49] = 4,[50] = 4,[51] = 4,[52] = 4,
}

--梭哈牌型
tex.cfg.paixin = _S{
	tonghuashun = 9, --同花顺
	bomb 		= 8, --炸弹
	sandaier 	= 7, --三带二
	tonghua 	= 6, --同花
	shun 		= 5, --杂顺
	sanzhang 	= 4, --三张
	liangdui 	= 3, --两对
	duizi 		= 2, --一对
	danzhang 	= 1, --单张
}

tex.gameref = 
{
	--结算
	REF_GOLD 			= 1,	--金币
	REF_PLAY		 	= 2,
	REF_WIN 			= 3,	--胜
	REF_EXP 			= 4,

	--礼物
	REF_RECV_GIFT		= 5,
	REF_GIVE_GIFT		= 6,

	--行为
	REF_ALLIN			= 7,
	REF_ZHUANG			= 8,

	--牌型
	REF_HULU			= 9,
	REF_TONGHUA			= 10,
	REF_SHUNZI			= 11,
	REF_SANTIAO			= 12,
	REF_LIANGDUI		= 13,
	REF_DANZHANG		= 14,
	REF_HJTONGHUASHUN	= 15,
	REF_TONGHUASHUN		= 16,
	REF_BOMB			= 17,
	REF_DUIZI			= 18,

	--特殊
	REF_SHUNZI_FAIED	= 19,
	REF_WIN_COUNT		= 20,
	REF_MUL				= 21,
	REF_HEITAOA			= 22,
	REF_GOLD2000		= 23,
	REF_SANTIAO_FAIED	= 24,
	
}

tex.gameref = _S(tex.gameref)
tex.checkjoinlist = 
{
	checklevel = function(userinfo, arg)
	local userdata = deskmgr.getuserdata(userinfo)
	return userdata.level >= arg
	end,
}

----------------quest--------------------
--任务奖励类型
tex.prize_type = _S
{		
	["GOLD"] = 1,
	["PRESTIGE"] = 2,
	["EXPERIENCE"] = 3,
}

--初始化桌子数据
tex.init_desk_info = function()
	trace("initdeskdata()")
	local desk_data = _S{
        rounddata = {
            timecheck = 0,
            roundcount = 0,
            sitecount = {},
            xiazhucount = 0,
		},
		state = gameflag.notstart,		--桌子状态 gameflag.notstart / gameflag.start
		zhuangsite = 0,					--庄家   0 / 1-9
        smallbetsite = 0,				--小盲
        lagrebetsite = 0,				--大盲
		leadersite = 0,					--第一个下注的座位
		round = 0,						--第X轮  0 / 0=无牌 1=三张 2=四张 3=五张
        pools = {},                     --当前彩池信息
		roundaddgold = 0,				--当前轮至少加注 默认为大盲注，别人加的话会加
		pokebox = {},					--牌盒的牌
		deskpokes = {},					--桌面的牌
		totalbetgold = 0,				--桌面的钱
		maxbetgold = 0,					--目前桌面上最大的注
		playinglist = {},				--从庄开始的座位号的列表
		starttime = os.date("%Y-%m-%d %X", os.time()),		--开始时间
		gamestart_playercount = 0,      --记录每局开始时候的人数

        --权宜之计:由于结算过程中有人坐下导致不能播放完结算动画的临时性解决方案
        --jiesuantime结算开始时间，needwait推测时长, someonestart期间有人点开始
        jiesuanwait = {},
        kickinfo = {},    --踢人状态
        kickedlist = {},    --被踢人的列表
	}

    desk_data.kickinfo.peoplecount = 0	--投票人数
	desk_data.kickinfo.userinfo = {}	--发起投票人
	desk_data.kickinfo.toupiaook = 0		--同意人数
	desk_data.kickinfo.toupiaonotok = 0	--不同意人数
	desk_data.kickinfo.toupiaoabort = 0  --弃权人数
    desk_data.kickinfo.kickuserinfo = {}	--被踢人的用户信息
    desk_data.kickinfo.toupiaoren = {} --投票人数组清空

    desk_data.jiesuanwait.jiesuantime = 0
    desk_data.jiesuanwait.needwait = 0
    desk_data.jiesuanwait.someonestart = 0
    if desk_data.jiesuanwait.startplan ~= nil then
        desk_data.jiesuanwait.startplan.cancel()
    end
    desk_data.jiesuanwait.startplan = nil
	return desk_data;
end

--初始化座位数据
tex.init_site_info = function()
	local site_data = _S({
        panellefttime = 0,                  --面板状态下，买礼物前，把剩余时间记录在这里，买礼物后重新计算面板剩余时间时从这里取值再
		isinround = 0,						--是否参加了游戏
		roundplayer = {},					--参赛选手的userinfo
		isbet = 0,							--当前轮是否下过注
		isallin = 0,						--是否全下了
		gold = 0,							--金币
		betgold = 0,						--总下注金额
        roundbet = 0,						--前面几轮的下注金额,一轮未完时不加到这里
		pokes = {},							--已发派
		pokes5 = {},						--最佳牌
		pokeweight = 0,						--最佳牌面值			
		panelrule = _S						--缓存面板规则,用于用户点面板回来校验
		{
			gengold 	= 0,	--跟多少钱
			gen			= 0,	--跟
			buxiazhu	= 0,	--过牌
			xiazhu		= 0,	--下注
			jia 		= 0,	--加
			allin		= 0,	--全下
			fangqi		= 0,	--放弃
			max			= 0,	--最大加(下)多少钱
			min 		= 0,	--最小加(下)多少钱
		},
		islose = 0,							--已出局
		logsql = "0,0,0,0,0,0,0,0,0",			--日志用的sql
		getgifecount = 0,		--记录本局得到了多少饮料礼物
	})
	return site_data;
end



--礼物价格
tex.cfg.giftlist = 
{
  --爵位羽毛
  [36] = 188888,
  
	--饮料
	[1001] = 50,
	[1002] = 50,
	[1003] = 50,
	[1004] = 80,
	[1005] = 80,
	[1006] = 200,
	[1007] = 80,
	[1008] = 300,
    [1009] = 500,
    [1010] = 500,
	--食物
	[2001] = 50,
	[2002] = 50,
	[2003] = 100,
	[2004] = 50,
	[2005] = 60,
	[2006] = 50,
	[2007] = 50,
    [2008] = 200,
    [2009] = 300,
    [2010] = 100,
	--香烟
	[3001] = 500,
	[3002] = 100,
	[3003] = 150,
    [3004] = 800,
	--吉祥物
	[4001] = 100,
	[4002] = 150,
	[4003] = 200,
	[4004] = 250,
	[4005] = 300,
	[4006] = 350,
	[4007] = 400,
	[4008] = 450,
	[4009] = 500,
	[4010] = 550,
	[4011] = 600,
	[4012] = 650,
	[4013] = 700,
	[4014] = 750,
	[4015] = 800,
	[4016] = 850,
	[4017] = 900,
    [4018] = 888,
    [4019] = 800,
    [4020] = 200,
    [4021] = 1388, --财神
    [4022] = 100,
    [4023] = 1388, --关公
    [4024] = 1388, --老神仙
    [4025] = 1388, --葫芦仙  
    --4026，4027光棍节活动占用  
   
    
    --可以出售的礼物
    [5001] = 10000, --蓝宝石
	[5002] = 50000, --绿宝石
	[5003] = 100000, --黄宝石
	[5004] = 500000, --红宝石
	[5005] = 1000000, --黑宝石
    [5006] = 209999,  --情人节礼物
    [5007] = 526316,  --五道杠50w
    [5008] = 52632,  --三道杠5w
    [5009] = 21053,  --二道杠2w
    [5010] = 1053,  --一道杠2k
    
    --可售的，并且是绝版的礼物
    [5011] = 1965895,  --186.76W可售礼物（奥迪A8）
    [5012] = 303158,  --28.8W可售礼物（甲壳虫）
    [5013] = 19790,  --1.88W可售礼物（奥拓）
    [5014] = 30,  --28可售礼物（幸运符：财）
    [5015] = 30,  --28可售礼物（幸运符：旺）
    [5016] = 30,  --28可售礼物（幸运符：运）
    [5017] = 3035685,  --288.39W可售礼物（奔驰S600）
    [5018] = 82948,  --7.88W可售礼物（雪铁龙C2）
    [5019] = 35579,  --3.38W可售礼物（夏利）
	[5020] = 280000,  --28W可售礼物（LV包）
	[5021] = 2966316,  --281.8W可售礼物（玛莎）
	[5022] = 26843,  --2.55W可售礼物（QQ）
	[5023] = 9347369,  --游艇888W
	[5024] = 6189474,  --法拉利588W
	[5025] = 13473685,  --宝时捷1280W
	[5026] = 19873685,  --兰博基尼1888W
    [5027] = 50105264,  --布加迪威龙4760W
 	[5028] = 8821053,	--白银龙舟838W
	[5029] = 24000000,	--黄金龙舟2280W 
	[5030] = 112422, 	--丰田雅力士10.68W
	[5031] = 48211, 	--海马爱尚4.58W
	[5032] = 66106, 	--奇瑞瑞麟6.28W
	[5033] = 189369, 	--福克斯2.0L 自动 旗舰型17.99W
	[5034] = 70422, 	--铃木新奥拓1.0L 自动6.69W
	  --中秋活动月饼
	  [5301] = 3000000, --晶月祝福
	  [5302] = 1000000, --雅月祝福
	  [5303] = 100000,  --素月祝福


     --绝版礼物
	[9001] = 1,  --圣诞老人的臭袜子
	[9002] = 1,  --红帽子
	[9003] = 1,  --绿帽子
	[9004] = 1,  --鞭炮
	[9005] = 1,  --福
	[9006] = 1,  --元宝
    [9007] = 1,  --冰激凌
    [9008] = 1,  --每日任务达人标志
    [9009] = 1,  --业余勋章
    [9010] = 1,  --职业勋章
    [9011] = 1,  --专家勋章
    [9012] = 1,  --圣诞火鸡礼物
    [9013] = 1,  --圣诞树礼物
    [9014] = 1,  --福字（礼物） 
    [9015] = 1,  --“红灯笼”礼物 
    [9016] = 1,  --“红心”礼物
    [9017] = 1,  --“红唇”礼物
    [9018] = 1,  --墓碑
    [9019] = 1,  --幽灵
    [9020] = 1,  --木乃伊  
    [9021] = 1,  --野兽
    [9022] = 1,  --火辣girl
    [9023] = 1,  --争霸赛冠军戒指
	[9024] = 1,  --性感美女
	[9025] = 1,  --OL美女
	[5035] = 1000, --新手勋章
	
    [100105] = 3888, --奥拓图纸1
    [100106] = 3888, --奥拓图纸2
    [100107] = 3888, --奥拓图纸3
    [100108] = 28800, --雪铁龙图纸
    [100109] = 88000, --甲壳虫图纸
    [100110] = 580000, --玛莎拉蒂图纸
    [100111] = 880000, --法拉利图纸
    [100112] = 2880000, --兰博基尼图纸
    [100113] = 5880000, --布加迪威龙图纸
    [100114] = 8880000, --布加迪威行百年黄金纪念图纸
    [100115] = 88880000, --神秘车图纸
    [100118] = 1000,   --浪漫玫瑰礼盒
		[100119] = 1000,   --奢华晶钻礼盒
		[200027] = 28888,  --成长勋章
	--100020到100022 已被中
	
	--100020到100022 已被中秋国庆使用

	--图纸统一100000之后间 过期定时删除用到此id规则
	--100107到100117 已经被合成系统升级占用
	--100000 到 200000 全部为图纸id
	--[200001] = 58800, -- 缤纷道具盒，属于道具
	  [200022] = 32800, -- 百变道具卡，属于道具
	--[200007] = 160000, --末日口粮
	--[200008] = 38888, --春节活动泉水
}


tex.msgtype = {firstsit = 1, gameover = 2, systips = 3}
tex.giftrank = {lasttime = 0, refreshing = 0, playerlist = {}}
--农场圣诞树
tex.farm_delaytime = 300
