-------------------------------------------------------
-- 文件名　：config_for_gaobei_diaoluo.lua
-- 创建者　：lgy
-- 创建时间：2013-1-9 14：00：00
-- 文件描述：德州高倍掉落配置文件
-------------------------------------------------------


--变量定义,配置信息
if not gaobei_diaoluo_lib then
    gaobei_diaoluo_lib = _S
    {
			--以下是方法
			
			--以下是变量及配置信息
			user_list = {},
			history_list = {},
    }    
end
gaobei_diaoluo_lib.CFG_START_TIME = "2013-1-11 09:00:00" --活动开始时间
gaobei_diaoluo_lib.CFG_END_TIME = "2020-5-15 23:59:59" --活动结束时间
gaobei_diaoluo_lib.number_min = 5
gaobei_diaoluo_lib.number_for8m = 30
gaobei_diaoluo_lib.number_for16m = 15



--德州高倍掉落奖励表 1参数表示(1道具，2礼物，3汽车，4三分钟赠票， 7是图纸，8终结事件，9是摇塞子机会)，2参数表示id  3参数表示数量 默认1
--gaobei_diaoluo_lib.BOX_ITEM_GIFT_ID={
--			[1]  = {1,2,5},  	--喇叭*5
--			[2]  = {1,1,2},  	--T卡*2
--			[3]  = {1,2,7},  	--喇叭*7
--			[4]  = {1,1,3},  	--T卡*3
--			[5]  = {2,5003,1},  	--黄宝石
--			[6]  = {2,5004,1},  	--红宝石
--			[7]  = {3,5013,1},  	--奥拓
--			[8]  = {7,100110,1},  --玛莎图纸
--			[9]  = {3,5012,1},  	--甲壳虫
--			[10] = {3,5026,1},  	--兰博基尼
--			[11] = {3,5021,1},  	--玛莎拉蒂
--}

gaobei_diaoluo_lib.BOX_ITEM_GIFT_ID={
        [1]  = {1,2,2},  	  --喇叭*2
        [2]  = {1,36,1},  	--爵位羽毛*1
        [3]  = {1,1,2},  	  --T卡*2
        [4]  = {1,2,3},  	  --喇叭*3
        [5]  = {1,1,3},  	  --T卡*3
        [6]  = {1,36,2},  	--爵位羽毛*1
        [7]  = {2,5003,1},  --黄宝石
        [8]  = {2,5004,1},  --红宝石
        [9]  = {3,5013,1},  --奥拓
        [10] = {7,100110,1},--玛莎图纸
        [11] = {3,5012,1},  --甲壳虫
        [12] = {3,5026,1},  --兰博基尼
        [13] = {3,5021,1},  --玛莎拉蒂
}

--物品概率
gaobei_diaoluo_lib.BOX_PORBABILITY_LIST = {
		1800,
		800,
		1800,
		1000,
		1000,
		400,
		500,
		200,
		1700,
		290,
		400,
		10,
		100,    
}

gaobei_diaoluo_lib.BOX_ITEM_GIFT_NAME = {
  [1]  = "喇叭*2", 
  [2]  = "爵位羽毛*1",
  [3]  = "T卡*2",     
  [4]  = "喇叭*3", 
  [5]  = "T卡*3",     
  [6]  = "爵位羽毛*1", 
  [7]  = "黄宝石",     
  [8]  = "红宝石",     
  [9]  = "奥拓",       
  [10] = "玛莎图纸",   
  [11] = "甲壳虫",     
  [12] = "兰博基尼",   
  [13] = "玛莎拉蒂",   
}
