-------------------------------------------------------
-- 文件名　：config_wing_lib.lua
-- 创建者　：lgy
-- 创建时间：2013-04-07 10：00：00
-- 文件描述：4月份 爵位翅膀活动
-------------------------------------------------------
--变量定义,配置信息
if not wing_lib then
    wing_lib = _S
    {	
			--以下是变量及配置信息
			user_list = {},
			wing_ranklist ={},
    }    
end
wing_lib.exp_num_item = 68
wing_lib.exp_play_everyday = {
  [0] = 200,
  [1] = 500,
  [2] = 2200,
  [3] = 10000,
  [4] = 22000,
  [5] = 75000,
  [6] = 220000,
  [7] = 660000,
  [8] = 3550000,
  [9] = 200,
  
}
--每日获得成长值上限（通过勋章）
wing_lib.cfg_exp_vip_item = {
  [0] = 5000,
  [1] = 10000,
  [2] = 15000,
  [3] = 20000,
  [4] = 25000,
  [5] = 30000,
  [6] = 35000,
}

--小盲注对应相应成长值配置
wing_lib.cfg_exp_play = {
	[1000] = 1,
	[2000] = 2,
	[5000] = 5,
	[10000] = 10,
	[20000] = 20,
	[25000] = 25,
	[40000] = 40,
}

--每个等级翅膀需要的成长值
wing_lib.cfg_exp_need_each= {
  [0] = 100,
  [1] = 400,
  [2] = 1600,
  [3] = 5000,
  [4] = 10000,
  [5] = 30000,
  [6] = 80000,
  [7] = 200000,
  [8] = 888888,
  [9] = 888888,
}

--每个等级翅膀需要的成长值
wing_lib.cfg_name_each_level= {
  [0] = "平民",
  [1] = "骑士",
  [2] = "准男爵",
  [3] = "男爵",
  [4] = "子爵",
  [5] = "伯爵",
  [6] = "侯爵",
  [7] = "公爵",
  [8] = "亲王",
  [9] = "国王",
}

--每个等级翅膀给的登录奖金
wing_lib.cfg_level_get_money= {
  [0] = 0,
  [1] = 288,
  [2] = 588,
  [3] = 888,
  [4] = 1288,
  [5] = 1888,
  [6] = 2888,
  [7] = 5888,
  [8] = 8888,
  [9] = 18888,
}

--每个等级翅膀合成成功后给的保险箱子格数
wing_lib.cfg_level_give_safebox= {
  [4] = 1,
  [5] = 1,
  [6] = 1,
  [7] = 1,
  [8] = 1,
  [9] = 1,
}


wing_lib.cfg_wing_id = {
  [1] = 27,
  [2] = 28,
  [3] = 29,
  [4] = 30,
  [5] = 31,
  [6] = 32,
  [7] = 33,
  [8] = 34,
  [9] = 35,
}

--不同爵位可以挂的工资袋时间
wing_lib.cfg_online_prize = {
  [0] = 0,
  [1] = 0,
  [2] = 1*3600 + 60,
  [3] = 2*3600 + 60,
  [4] = 3*3600 + 60,
  [5] = 4*3600 + 60,
  [6] = 5*3600 + 60,
  [7] = 6*3600 + 60,
  [8] = 7*3600 + 60,
  [9] = 8*3600 + 60,
}

--图纸id对应失败退回的翅膀
wing_lib.cfg_tzid_wingid = {
  [100121] = 27,
  [100122] = 28,
  [100123] = 29,
  [100124] = 30,
  [100125] = 31,
  [100126] = 32,
  [100127] = 33,
  [100128] = 34,
}


--男爵宝箱、子爵宝箱、伯爵宝箱、侯爵宝箱
wing_lib.BOX_ITEM_GUIZU = {
  [3] = 200023,
  [4] = 200024,
  [5] = 200025,
  [6] = 200026,
}
wing_lib.BOX_ITEM_GUIZU_NEED = {
  [3] = 20,
  [4] = 20,
  [5] = 20,
  [6] = 20,
}


--是否需要广播
wing_lib.need_broadcast = {

  [200023]={
	  [36] = {1,"爵位羽毛"},--爵位羽毛*1
	  [100109] = {1,"甲壳虫图纸"},--甲壳虫图纸
	  [100110] = {1,"玛莎拉蒂图纸"},--玛莎图纸
  	[5012] = {1,"甲壳虫"}, --甲壳虫
  	[5021] = {1,"玛莎拉蒂"}, --玛莎拉蒂
  },
  [200024]={
	  [36] = {1,"爵位羽毛"},--爵位羽毛*1
	  [100109] = {1,"甲壳虫图纸"},--甲壳虫图纸
	  [100110] = {1,"玛莎拉蒂图纸"},--玛莎图纸
	  [100111] = {1,"法拉利图纸"},	--法拉利图纸
  	[5012] = {1,"甲壳虫"}, --甲壳虫
  	[5021] = {1,"玛莎拉蒂"}, --玛莎拉蒂
  },
  [200025]={
	  [36] = {1,"爵位羽毛"},--爵位羽毛*1
	  [100110] = {1,"玛莎拉蒂图纸"},--玛莎图纸
	  [100111] = {1,"法拉利图纸"},	--法拉利图纸
  	[5021] = {1,"玛莎拉蒂"}, --玛莎拉蒂
  	[5012] = {1,"甲壳虫"}, --甲壳虫
  	[5024] = {1,"法拉利"},--法拉利
  },
  [200026]={
	  [36] = {1,"爵位羽毛*2"},--爵位羽毛*1
	  [100110] = {1,"玛莎拉蒂图纸"},--玛莎图纸
	  [100111] = {1,"法拉利图纸"},	--法拉利图纸
	  [100112] = {1,"兰博基尼图纸"},	--法拉利图纸
  	[5021] = {1,"玛莎拉蒂"}, --玛莎拉蒂
  	[5024] = {1,"法拉利"},--法拉利
  	[5026] = {1,"兰博基尼"}--兰博基尼
  },
}

wing_lib.box_name = {
 [200023] = "男爵宝箱",
 [200024] = "子爵宝箱",
 [200025] = "伯爵宝箱",
 [200026] = "侯爵宝箱",
}