-------------------------------------------------------
-- 文件名　：config_christmas.lua
-- 创建者　：lgy
-- 创建时间：2012-12-13 18：00：00
-- 文件描述：世界末日大逃亡活动配置信息
-------------------------------------------------------


--变量定义,配置信息
if not christmas_lib then
    christmas_lib = _S
    {
			--以下是方法
			
			--以下是变量及配置信息
			user_list = {},
			history_list = {},
    }    
end
christmas_lib.CFG_START_TIME = "2012-12-25 09:00:00" --活动开始时间
christmas_lib.CFG_END_TIME = "2012-12-31 23:59:59" --活动结束时间



--世界末日活动奖励表 1参数表示(1道具，2礼物，3汽车，4三分钟赠票， 7是图纸，8终结事件，9是摇塞子机会)，2参数表示id  3参数表示数量 默认1
christmas_lib.BOX_ITEM_GIFT_ID={
		[1]={
			[1] = {3,5043,1}, --天津大发
		},
		[2]={
			[1] = {3,5043,1}, --天津大发
			[2] = {1,2,1},   --一个喇叭							
		},
		[3]={
			[1] = {7,100109,1},  --甲壳虫图纸
			[2] = {1,1,1},  	--一个T卡
			[3] = {7,100110,1}, --玛莎拉蒂图纸
			[4] = {7,100111,1}, --法拉利图纸
		},
		[4]={
			[1] = {7,100109,1},  --甲壳虫图纸
			[2] = {7,100114,1}, --黄金版布加迪图纸
			[3] = {7,100113,1},  --布加迪图纸
		},
}

--物品概率
christmas_lib.BOX_PORBABILITY_LIST = {
	[1] ={
		1000,    
	},
	[2] = {
		1500, 
		50,
	},
	[3] = {
		200,	
		200,	
		50, 
		10,
	},
	[4] = {
		400,
		10,
		15,
	},
}

christmas_lib.BOX_ITEM_GIFT_NAME = {
		[1]={
			[1] = "天津大发",
		},
		[2]={
			[1] = "天津大发",
			[2] = "一个喇叭",
		},
		[3]={
			[1] = "甲壳虫图纸",
			[2] = "一个T卡",
			[3] = "玛莎拉蒂图纸",
			[4] = "法拉利图纸",
		},
		[4]={
			[1] = "甲壳虫图纸",
			[2] = "布加迪威龙(黄金版)图纸",
			[3] = "布加迪威龙图纸",
		},
}
