-------------------------------------------------------
-- 文件名　：config_end_world.lua
-- 创建者　：lgy
-- 创建时间：2012-12-13 18：00：00
-- 文件描述：世界末日大逃亡活动配置信息
-------------------------------------------------------


--变量定义,配置信息
if not end_world then
    end_world = _S
    {
			--以下是方法
			
			--以下是变量及配置信息
			user_list = {},
			history_list = {},
    }    
end
end_world.CFG_START_TIME = "2012-12-20 09:00:00" --活动开始时间
end_world.CFG_END_TIME = "2012-12-31 23:59:59" --活动结束时间
end_world.CFG_MAX_PAN_FRESH = 10 --新手场最多10场
end_world.CFG_NEED_PAN = 30
end_world.CFG_HISTORY_LEN = 50


--世界末日活动奖励表 1参数表示(1道具，2礼物，3汽车，4三分钟赠票， 7是图纸，8终结事件，9是摇塞子机会)，2参数表示id  3参数表示数量 默认1
end_world.BOX_ITEM_GIFT_ID={
		[1]={
			[1] = {8,-1,-1}, --终结事件
			[2] = {4,-1,3},  --3赠票
			[3] = {7,100107,1},--奥拓图纸
			[4] = {7,100109,1,1},  --甲壳虫图纸
			[5] = {3,5043,1},-- 天津大发
			[6] = {3,5013,1,1},-- 奥拓
			[7] = {1,2,1},   -- 小喇叭
		},
		[2]={
			[1] = {8,-1,-1}, --终结事件
			[2] = {4,-1,10},  --10赠票
			[3] = {3,5013,1}, -- 奥拓
			[4] = {3,5030,1,1}, -- 丰田雅力士
			[5] = {3,5017,1,1,4}, -- 奔驰
			[6] = {7,200007,1,1}, -- 末日口粮
			[7] = {7,100109,1},  --甲壳虫图纸							
		},
		[3]={
			[1] = {8,-1,-1},  --终结事件
			[2] = {4,-1,15},  --15赠票
			[3] = {2,5003,1}, --黄宝石
			[4] = {7,100110,1,1},  --玛莎拉蒂图纸	
			[5] = {3,5012,1,1}, -- 甲壳虫
			[6] = {3,5024,1,1,3}, -- 法拉利
			[7] = {7,100112,1,1,6},  --兰博基尼图纸		
		},
		[4]={
			[1] = {2,5005,1}, --黑宝石
			[2] = {2,5004,1}, --红宝石
			[3] = {4,-1,100},  --100赠票
			[4] = {7,200001,10},--缤纷道具盒
			[5] = {3,5021,1,1,5}, -- 玛莎拉蒂
			[6] = {3,5036,1,1,1}, -- 布加迪威龙(黄金版)
			[7] = {7,100113,1,1,2},  --布加迪威龙图纸			
		},
}


--物品概率
end_world.BOX_PORBABILITY_LIST={
	[1] ={
		2500, 
		2500,   
		1500,  
		500,  
		1500,  
		500,  
		1000,  
	},
	[2] = {
		3500, 
		2500,
		2000,  
		500, 
		100,
		500,
		900,				
	},
	[3] = {
		4500,	
		2500,	
		1000, 
		1650,
		250,
		50,
		50,
	},
	[4] = {
		1500,
		2000,
		2000,
		2500,
		1500, 
		250,
		250,
	},
}


end_world.BOX_ITEM_GIFT_NAME = {
		[1]={
			[1] = "终结事件",
			[2] = "3赠票",
			[3] = "奥拓图纸",
			[4] = "甲壳虫图纸",
			[5] = "一辆天津大发",
			[6] = "一辆奥拓",
			[7] = "一个小喇叭",
		},
		[2]={
			[1] = "终结事件",
			[2] = "10赠票",
			[3] = "一辆奥拓",
			[4] = "一辆丰田雅力士",
			[5] = "一辆奔驰",
			[6] = "一个末日口粮",
			[7] = "甲壳虫图纸",	
		},
		[3]={
			[1] = "终结事件",
			[2] = "15赠票",
			[3] = "黄宝石",
			[4] = "玛莎拉蒂图纸",
			[5] = "一辆甲壳虫",
			[6] = "一辆法拉利",
			[7] = "兰博基尼图纸",
		},
		[4]={
			[1] = "黑宝石",
			[2] = "红宝石",
			[3] = "100赠票",
			[4] = "缤纷道具盒",
			[5] = "玛莎拉蒂",
			[6] = "一辆布加迪威龙(黄金版)",
			[7] = "布加迪威龙图纸",
		},
}
