gameflag={notstart = 0,start = 1}

room.cfg.deskcount=250   --五百张桌（3000人）
room.cfg.DeskSiteCount = 6--2--4--6  --每桌6个位
room.cfg.pokerCount = 52	--每张台52张牌
room.cfg.MinDeskSiteCount = 0  --最少两个人可以玩

deskqueue = {} --桌子队列，用于计算桌子剩余的座位顺序
--------------------------------------------------------------------------------
--zysz初始化相关参数
zysz = {}

zysz.caichi = {} --彩池信息
zysz.caichi.sumgold = 0
zysz.caichi.orgsumgold = 0 --上一次彩池数据
zysz.caichi.lastwintime = 0
zysz.caichi.lastwinuser = ""
zysz.caichi.lastwinmoney = 0   --彩池获奖金币	
zysz.caichi.addMoney = 0	--彩池投注金额（每次投注额）
zysz.caichi.isshowhuojiang = 0 --是否显示获奖人0不显示，1显示
zysz.caichi.userid = 0--who中了

zysz.cfg = {}
zysz.cfg.players = room.cfg.DeskSiteCount -- 6
zysz.cfg.pokemin = 1  --从1开始编号    梅、方、红、黑 排序, 53,54 是小王、大王
zysz.cfg.pokemax = 54 --54为结束编号
zysz.cfg.handpokenum = 3 --每人三张牌
zysz.cfg.caichi = 0.05	--彩池下注比例(单注封顶×彩池下注比例 = 彩池下注金额）
zysz.cfg.hhsmaxtime = 13 --回合中每手最大等待时间为13秒
zysz.cfg.last_broadcast_user_id = 0 -- 上一次全服广播的用户id位数

zysz.cfg.seq ={ --叫牌及出牌顺序
[1] = 3,
[2] = 1,
[3] = 2,
}

zysz.arg = {}
zysz.arg.siteno = 0
zysz.arg.deskno = 0
zysz.arg.mygold = 0

zysz.randpokes = {}

zysz.pokechar = {
[1]   = 'A', [2] = '2', [3]   = '3',[4]  = '4', [5]   = '5',[6]   = '6',[7]   = '7',[8]   = '8',[9]   = '9',[10] = 'X',[11] = 'J',[12] = 'Q',[13] = 'K',
[14]  = 'A', [15] = '2',[16]  = '3',[17]  = '4',[18]  = '5',[19]  = '6',[20]  = '7',[21]  = '8',[22]  = '9',[23] = 'X',[24] = 'J',[25] = 'Q',[26] = 'K',
[27]  = 'A', [28] = '2',[29]  = '3',[30]  = '4',[31]  = '5',[32]  = '6',[33]  = '7',[34]  = '8',[35]  = '9',[36] = 'X',[37] = 'J',[38] = 'Q',[39] = 'K',
[40]  = 'A', [41] = '2',[42]  = '3',[43]  = '4',[44]  = '5',[45]  = '6',[46]  = '7',[47]  = '8',[48]  = '9',[49] = 'X',[50] = 'J',[51] = 'Q',[52] = 'K',
[53]  = 'g', [54] = 'G'
}
zysz.pokenum = {
[1]   = 14, [2] = 2, [3]   = 3,[4]   = 4, [5]   = 5,[6]   = 6,[7]   = 7,[8]   = 8,[9]   = 9,[10] = 10,[11] = 11,[12] = 12,[13] = 13,
[14]  = 14, [15] = 2,[16]  = 3,[17]  = 4, [18]  = 5,[19]  = 6,[20]  = 7,[21]  = 8,[22]  = 9,[23] = 10,[24] = 11,[25] = 12,[26] = 13,
[27]  = 14, [28] = 2,[29]  = 3,[30]  = 4, [31]  = 5,[32]  = 6,[33]  = 7,[34]  = 8,[35]  = 9,[36] = 10,[37] = 11,[38] = 12,[39] = 13,
[40]  = 14, [41] = 2,[42]  = 3,[43]  = 4, [44]  = 5,[45]  = 6,[46]  = 7,[47]  = 8,[48]  = 9,[49] = 10,[50] = 11,[51] = 12,[52] = 13,
[53]  = 100, [54] = 101
}

zysz.pokecolor = {
[1]   = 1, [2] = 1, [3]   = 1,[4]   = 1, [5]   = 1,[6]   = 1,[7]   = 1,[8]   = 1,[9]   = 1,[10] = 1,[11] = 1,[12] = 1,[13] = 1,
[14]  = 2, [15] = 2,[16]  = 2,[17]  = 2, [18]  = 2,[19]  = 2,[20]  = 2,[21]  = 2,[22]  = 2,[23] = 2,[24] = 2,[25] = 2,[26] = 2,
[27]  = 3, [28] = 3,[29]  = 3,[30]  = 3, [31]  = 3,[32]  = 3,[33]  = 3,[34]  = 3,[35]  = 3,[36] = 3,[37] = 3,[38] = 3,[39] = 3,
[40]  = 4, [41] = 4,[42]  = 4,[43]  = 4, [44]  = 4,[45]  = 4,[46]  = 4,[47]  = 4,[48]  = 4,[49] = 4,[50] = 4,[51] = 4,[52] = 4,
[53]  = 5, [54] = 6
}


--豹子的牌型
zysz.pokebaozi = {
   	["222"] = 1,["333"] = 2, ["444"] = 3, ["555"] = 4, ["666"] = 5, ["777"] = 6,["888"] = 7, ["999"] = 8, ["XXX"] = 9, ["JJJ"] = 10, ["QQQ"] = 11, ["KKK"] = 12, ["AAA"] = 13
}

--顺子的牌型
zysz.pokeshunzi = {
   	["23A"] = 1,["234"] = 2,["345"] = 3, ["456"] = 4, ["567"] = 5, ["678"] = 6, ["789"] = 7,["89X"] = 8, ["9XJ"] = 9, ["XJQ"] = 10, ["JQK"] = 11, ["QKA"] = 12
}

--偷鸡牌型
zysz.poketouji = {
	["235"] = 1
}
--对子的牌型
zysz.pokeduizi = {
   	["223"] = 1,["233"] = 13, ["244"] = 25, ["255"] = 37, ["266"] = 49, ["277"] = 61,["288"] = 73, ["299"] = 85, ["2XX"] = 97, ["2JJ"] = 109, ["2QQ"] = 121, ["2KK"] = 133, ["2AA"] = 145,
   	["224"] = 2,["334"] = 14, ["344"] = 26, ["355"] = 38, ["366"] = 50, ["377"] = 62,["388"] = 74, ["399"] = 86, ["3XX"] = 98, ["3JJ"] = 110, ["3QQ"] = 122, ["3KK"] = 134, ["3AA"] = 146,
   	["225"] = 3,["335"] = 15, ["445"] = 27, ["455"] = 39, ["466"] = 51, ["477"] = 63,["488"] = 75, ["499"] = 87, ["4XX"] = 99, ["4JJ"] = 111, ["4QQ"] = 123, ["4KK"] = 135, ["4AA"] = 147,
   	["226"] = 4,["336"] = 16, ["446"] = 28, ["556"] = 40, ["566"] = 52, ["577"] = 64,["588"] = 76, ["599"] = 88, ["5XX"] = 100, ["5JJ"] = 112, ["5QQ"] = 124, ["5KK"] = 136, ["5AA"] = 148,
   	["227"] = 5,["337"] = 17, ["447"] = 29, ["557"] = 41, ["667"] = 53, ["677"] = 65,["688"] = 77, ["699"] = 89, ["6XX"] = 101, ["6JJ"] = 113, ["6QQ"] = 125, ["6KK"] = 137, ["6AA"] = 149,
   	["228"] = 6,["338"] = 18, ["448"] = 30, ["558"] = 42, ["668"] = 54, ["778"] = 66,["788"] = 78, ["799"] = 90, ["7XX"] = 102, ["7JJ"] = 114, ["7QQ"] = 126, ["7KK"] = 138, ["7AA"] = 150,
   	["229"] = 7,["339"] = 19, ["449"] = 31, ["559"] = 43, ["669"] = 55, ["779"] = 67,["889"] = 79, ["899"] = 91, ["8XX"] = 103, ["8JJ"] = 115, ["8QQ"] = 127, ["8KK"] = 139, ["8AA"] = 151,
   	["22X"] = 8,["33X"] = 20, ["44X"] = 32, ["55X"] = 44, ["66X"] = 56, ["77X"] = 68,["88X"] = 80, ["99X"] = 92, ["9XX"] = 104, ["9JJ"] = 116, ["9QQ"] = 128, ["9KK"] = 140, ["9AA"] = 152,
   	["22J"] = 9,["33J"] = 21, ["44J"] = 33, ["55J"] = 45, ["66J"] = 57, ["77J"] = 69,["88J"] = 81, ["99J"] = 93, ["XXJ"] = 105, ["XJJ"] = 117, ["XQQ"] = 129, ["XKK"] = 141, ["XAA"] = 153,
   	["22Q"] = 10,["33Q"] = 22, ["44Q"] = 34, ["55Q"] = 46, ["66Q"] = 58, ["77Q"] = 70,["88Q"] = 82, ["99Q"] = 94, ["XXQ"] = 106, ["JJQ"] = 118, ["JQQ"] = 130, ["JKK"] = 142, ["JAA"] = 154,
   	["22K"] = 11,["33K"] = 23, ["44K"] = 35, ["55K"] = 47, ["66K"] = 59, ["77K"] = 71,["88K"] = 83, ["99K"] = 95, ["XXK"] = 107, ["JJK"] = 119, ["QQK"] = 131, ["QKK"] = 143, ["QAA"] = 155,
   	["22A"] = 12,["33A"] = 24, ["44A"] = 36, ["55A"] = 48, ["66A"] = 60, ["77A"] = 72,["88A"] = 84, ["99A"] = 96, ["XXA"] = 108, ["JJA"] = 120, ["QQA"] = 132, ["KKA"] = 144, ["KAA"] = 156

}

zysz.time = 0; --心跳检查

--参考定义
zysz.gameref = 
{
	REF_GOLD 			= 1,	--金币
	REF_EXP		 		= 2,	--经验
	REF_WIN 			= 3,	--连胜王
	REF_JINHUA 			= 4,	--金花王 !
	REF_BIGWIN 			= 5,	--大胜王
    	
    REF_KANPAI          = 7,    --是否看了牌 !
    REF_MENKAI          = 8,    --闷开 !
    REF_NOMONEY         = 9,    --这个没用了
    REF_SMALLCAICHI     = 10,   --拿到5倍以下彩池奖励
    REF_DOUBLEKILL      = 11,   --这个没用了
    REF_FIRSTKILL       = 12,   --第一个与人比牌
    REF_DANPAI          = 13,   --单牌牌型 !
    REF_SPIKE           = 14,   --秒杀，跨牌型赢
    REF_SHUNJIN         = 15,   --顺金牌型 !
    REF_DUIZI           = 16,   --对子牌型
    REF_BIGCAICHI       = 18,   --拿到5倍以上彩池奖励
    REF_TRIPLEKILL      = 19,   --系统自动开牌时有三个或超过三个人输
    REF_WINPOINT        = 20,   --连胜
    REF_WINGOLD1W       = 21,   --一盘赢1W+金币
    REF_WINCAICHI100    = 22,   --一盘赢100+彩池金币
    REF_XIANSHENG       = 23,   --险胜，与对手牌型一样，牌型数字相差不到3
    REF_WINMATCH        = 24,   --获得一场30分钟比赛胜利
    REF_BAOZI           = 25,   --豹子牌型
    REF_WINGOLD10W      = 26,   --一把赢10W+金币
    REF_WINCAICHI1000   = 27,   --一把赢1000+彩池金币     
    REF_GIVEUP3         = 29,   --桌内其他3人放弃
    REF_235             = 30,   --拿到非金花235并且赢
    REF_WINJINHUA       = 31,   --赢了别人的金花           
    REF_PLAY            = 32,   --玩一盘  
    REF_JINHUAWINPOINT  = 33,   --金花累计赢
    REF_DANPAIWINPOINT  = 34,   --单牌累计赢    
    REF_NOADD           = 35,   --是否加注了
    REF_KAIPAIWINPOINT  = 36,   --主动开牌累计赢
    REF_NARROW          = 37,   --被别人开牌而且是相同牌型
    REF_BIGPAIXING      = 38,   --超过金花的牌型
    REF_235LOST         = 39,   --235输掉了
    REF_AUTOBIPAI       = 40,   --系统自动比牌
}

zysz.gameref = _S(zysz.gameref)
zysz.checkjoinlist = 
{
	checklevel = function(userinfo, arg)			
		return userinfo.gameInfo.level >= arg
	end,
}

----------------quest--------------------
--任务奖励类型
zysz.prize_type = _S
{		
    ["GOLD"] = 1,
    ["PRESTIGE"] = 2,
}

