-------------------------------------------------------
-- 文件名　：config_pay_give_car.lua
-- 创建者　：lgy
-- 创建时间：2013-03-08 18：00：00
-- 文件描述：3月活动 充值送车钥匙
-------------------------------------------------------


--变量定义,配置信息
pay_give_car = pay_give_car or {}
pay_give_car.user_list = pay_give_car.user_list or {}
pay_give_car.CFG_START_TIME = "2013-03-15 09:00:00" --活动开始时间
pay_give_car.CFG_END_TIME = "2013-03-31 23:59:59" --活动结束时间

if not pay_give_car.already_get_car then
    pay_give_car.already_get_car =
    {
      [200016]={
        [5013] = {0,key=1}, --奥拓*2
        [5018] = {0,key=2}, --雪铁龙
        [5012] = {0,key=3}, --甲壳虫
        [5049] = {0,key=4}, --宝马Z4
        [5011] = {0,key=5}, --奥迪A8
      },
      [200017]={
        [5012] = {0,key=1}, --甲壳虫
        [5049] = {0,key=2}, --宝马Z4
        [5011] = {0,key=3}, --奥迪A8
        [5021] = {0,key=4}, --玛莎拉蒂
        [5024] = {0,key=5}, --法拉利
      },
      [200018]={
        [5049] = {0,key=1}, --宝马Z4
        [5011] = {0,key=2}, --奥迪A8
        [5021] = {0,key=3}, --玛莎拉蒂
        [5024] = {0,key=4}, --法拉利
        [5026] = {0,key=5},  --兰博基尼
      },                    
    }    
end
--是否需要广播
pay_give_car.need_broadcast = {
  [200016]={
  	[5013] = {0,"奥拓x2"}, --奥拓*2
  	[5018] = {0,"雪铁龙"}, --雪铁龙
  	[5012] = {0,"甲壳虫"}, --甲壳虫
  	[5049] = {1,"宝马Z4"}, --宝马Z4
  	[5011] = {1,"奥迪A8"}, --奥迪A8
  },
  [200017]={
  	[5012] = {0,"甲壳虫"}, --甲壳虫
  	[5049] = {0,"宝马Z4"}, --宝马Z4
  	[5011] = {0,"奥迪A8"}, --奥迪A8
  	[5021] = {1,"玛莎拉蒂"}, --玛莎拉蒂
  	[5024] = {1,"法拉利"}, --法拉利
  },
  [200018]={
  	[5049] = {0,"宝马Z4"},--宝马Z4
  	[5011] = {0,"奥迪A8"}, --奥迪A8
  	[5021] = {0,"玛莎拉蒂"}, --玛莎拉蒂
  	[5024] = {1,"法拉利"},--法拉利
  	[5026] = {1,"兰博基尼"}, --兰博基尼
  },
}

pay_give_car.box_name = {
  [200016]="白银钥匙",
  [200017]="黄金钥匙",
  [200018]="宝石钥匙",
}